# GetLeftSupports Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsRun..::..GetLeftSupports Method
StairsRun Class See Also
---
Retrieves all supports on the left side of run boundaries.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IList<ElementId> GetLeftSupports()
```

Visual Basic
---
```text
Public Function GetLeftSupports As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetLeftSupports()
```

# ### Return Value
The supports on the left side of run boundaries.
# See Also
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace